       01 OPTIMAL-RECORD.
          05 REC-ID               PIC 9(8).
          05 REC-NAME             PIC X(30).
          05 REC-CITY             PIC X(20).
          05 REC-AGE              PIC 9(3).
          05 REC-SCORE            PIC 9(5).
          05 REC-DATE-YYYYMMDD    PIC 9(8).
