       01 LINE-ITEMS.
          05 ORDER-ID             PIC 9(8).
          05 ITEM OCCURS 3 TIMES.
             10 ITEM-ID           PIC 9(6).
             10 ITEM-QTY          PIC 9(4).
             10 ITEM-PRICE        PIC S9(5)V99.
