       01 PERSON.
          05 PERSON-ID            PIC 9(8).
          05 BIRTH-YYYYMMDD       PIC 9(8).
          05 HIRE-YYMMDD          PIC 9(6).
          05 UPDATE-TIMESTAMP     PIC 9(14).
